OdCharMapper.systemCodePage
\details
Returns code page Id based on OS information.
OdRxSystemServices::systemCodePage() usage is preferable.
It can be altered in client implementation of System Services.

OdCharMapper.embedTextRawData(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Int32,OdMemoryAllocator&lt;System.Int32&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32*,System.Boolean*)
\details
Conversion source string with flags underlined, overlined and striked to string with special sequence %%u, %%o and %%k
\param str [in] Source string.
\param ulRanges [in] Ranges underlined, overlined and striked.
\param length [out] Length returned string.
\param raw [out] Raw flag.
\returns Result string with special sequences if it is needed

OdCharMapper.containsSpecialSequence(OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdFont*,OdArray&lt;System.Int32,OdMemoryAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checking special sequences and replacing them with character codes. Look for following sequences: "%%", "\\U+", "\\u+", "\\M+", "\\m+".
\param str [in/out] Source string.
\param font [in] Font.
\param ulRanges [out] Ranges underlined, overlined and striked.
\returns true if special sequence was found and replaced, or false otherwise.

OdCharMapper.convertAlphaNumJapanese(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets a converted ANSI string from a specified string in the Latin alphanumeric Japanese code page.
\param str [in] Source string for conversion.
\returns The ANSI string converted from the Latin alphanumeric Japanese code page.

OdCharMapper.convertAlphaNumJapanese(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets a converted Unicode string from the specified string in the Latin alphanumeric Japanese Unicode range.
\param str [in] Source string for conversion.
\returns The Unicode string converted from the Latin alphanumeric Japanese Unicode range.

OdCharMapper.convertCIFcoding(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets a converted Unicode string from the specified CIF coding string.
\param str [in] Source string for conversion.
\returns The Unicode string converted from the CIF coding string.

OdCharMapper.getCheckSumUnicode(OdString)
\details
Gets the check sum for a Unicode string.
\param str [in] String for calculating the check sum.
\returns The check sum for a Unicode string.

OdCharMapper.getCheckSumAnsi(OdAnsiString)
\details
Gets the check sum for an ANSI string.
\param str [in] String for calculating the check sum.
\returns The check sum for an ANSI string.

OdCharMapper.getCpIndexByBigFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the code page index from a bigFont file name.
\param bigFont [in] Big font file name.
\returns The code page index.
\remarks
getCpIndexByBigFont returns one of the following:
Value     Description
1         CP_ANSI_932
2         CP_ANSI_950
3         CP_ANSI_949
5         CP_ANSI_936

OdCharMapper.getCpByBigFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the code page from a big font file name.
\param bigFont [in] Big font file name.
\returns The code page.
\remarks
getCpByBigFont returns one of the following:
@untitled table
CP_ANSI_932
CP_ANSI_950
CP_ANSI_949
CP_ANSI_936

OdCharMapper.addBigFontWithCodepage(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCodePageId)
\details
Adds a bigFont to a map with the specified code page ID.
\param bigFont [in] Big font file name.
\param codePageId [in] Code page ID.
\returns eOk if the bigFont is added to the map successfully, or an appropriate error code otherwise.
\remarks
codePageId must be one of the following:
@untitled table
CP_ANSI_932
CP_ANSI_950
CP_ANSI_949
CP_ANSI_936

OdCharMapper.addBigFontWithIndex(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Adds a bigFont to a map with the specified code page index.
\param bigFont [in] Big font file name.
\param cpIndex [in] Code page index.
\returns eOk if the bigFont is added to the map successfully, or an appropriate error code otherwise.
\remarks
cpIndex must be one of the following:
Value    Description
1        CP_ANSI_932
2        CP_ANSI_950
3        CP_ANSI_949
5        CP_ANSI_936

OdCharMapper.unicodeToUtf8(System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,OdMemoryAllocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the Unicode characters to UTF-8.
\param srcBuf [in] Source Unicode character buffer.
\param srcSize [in] Size of the source character buffer.
\param dstBuf [out] Receives the UTF-8 character array.

OdCharMapper.utf8ToUnicode(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;System.UInt16,OdMemoryAllocator&lt;System.UInt16&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the UTF-8 characters to Unicode.
\param srcBuf [in] Source UTF-8 character buffer.
\param srcSize [in] Size of the source character buffer.
\param dstBuf [out]  Receives the Unicode character array.
\returns true if the value is mapped successfully, or false otherwise.

OdCharMapper.multiByteToWideChar(OdCodePageId,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;System.UInt16,OdMemoryAllocator&lt;System.UInt16&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the specified code page characters to Unicode.
\param codepage [in]  Source character code page.
\param srcBuf [in]  Source character buffer.
\param srcSize [in] Size source character buffer.
\param dstBuf [out]  Receives the Unicode character array.

OdCharMapper.wideCharToMultiByte(OdCodePageId,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,OdMemoryAllocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the Unicode characters to the specified code page.
\param codepage [in]  Destination character code page.
\param srcBuf [in] Source Unicode character buffer.
\param srcSize [in] Size of the source character buffer.
\param dstBuf [out]  Receives the character array in the specified code page.

OdCharMapper.isConversionSupported(OdCodePageId)
\details
Checks whether the specified code page supports conversion.
\param codepageId [in]  Object ID of the code page.
\returns true if the specified code page supports conversion, or false otherwise.

OdCharMapper.getReorderCharsetByChar(System.UInt16)
\details
Gets the charset corresponding to the specified character.
\param ch [in]  Character.
\returns The charset corresponding to the specified character.
\remarks
If the character is in the Hebrew range, returns 0xB1.
If the character is in the Arabic range, returns 0xB2.
Otherwise returns 0.

OdCharMapper.getCodepageByCharset(System.UInt16)
\details
Returns the code page corresponding to the specified ANSI character set.
\param ansiCharacterSet [in] Character set.
\returns The code page corresponding to the specified ANSI character set.

OdCharMapper.acadCpToAnsiCp(OdCodePageId)
\details
Returns the ANSI code page corresponding to the specified code page.
\param acadCodePageId [in] Code page.
\returns The ANSI code page corresponding to the specified code page.

OdCharMapper.ansiCpToAcadCp(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the code page corresponding to the specified ANSI code page.
\param ansiCodePage [in] ANSI code page.
\returns The code page corresponding to the specified ANSI code page.

OdCharMapper.numValidCodepages
\details
Returns the number of valid code pages for this CharMapper object.
\returns The number of valid code pages for this CharMapper object.

OdCharMapper.codepageIdToDesc(OdCodePageId,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the description for the specified code page.
\param codepageId [in] Object ID of the code page.
\param description [out] Receives the description.
\returns eOk if the description is received successfully, or an appropriate error code otherwise.

OdCharMapper.codepageDescToId(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCodePageId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the code page with the specified description.
\param description [in] Description.
\param codepageId [out] Receives the object ID of the code page.
\returns eOk if the object ID of the code page is received successfully, or an appropriate error code otherwise.

OdCharMapper.isLeadByte(System.Byte,OdCodePageId)
\details
Checks whether the specified byte is one of the leading bytes of the specified code page.
\param testByte [in] Byte to test.
\param codepageId [in] Object ID of the code page.
\returns true if the specified byte is one of the leading bytes of the specified code page, or false otherwise.

OdCharMapper.codepageToUnicode(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the specified code page character to Unicode.
\param sourceChar [in]  Code page source character.
\param codepageId [in]  Object ID of the code page.
\param unicodeChar [out]  Receives the Unicode character.
\returns eOk if the Unicode character is received successfully, or an appropriate error code otherwise.

OdCharMapper.unicodeToCodepage2(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the specified Unicode character to the specified code page using the IMLangFontLink2 interface.
\param sourceChar [in]  Unicode source character.
\param codepageId [in]  Object ID of the code page.
\param codepageChar [out]  Receives the code page character.
\returns eOk if the code page character is received successfully, or an appropriate error code otherwise.

OdCharMapper.unicodeToCodepage(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Maps the specified Unicode character to the specified code page.
\param sourceChar [in] Unicode source character.
\param codepageId [in] Object ID of the code page.
\param codepageChar [out] Receives the code page character.
\param bTryToUseSystemCP [in] Try to use the default ANSI code page and OEM code page if conversion with codepageId is not OK.
\returns eOk if the code page character is received successfully, or an appropriate error code otherwise.

OdCharMapper.initialize(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Initializes this CharMapper object from the specified mapping file.
\param filename [in] File name.
\returns eOk if the CharMapper is initialized successfully, or an appropriate error code otherwise.